In [1]:
import pandas as pd
import numpy as np

### Intializing our river data

In [2]:
river_dict = {'river': ['Missouri', 'Mississippi', 'Yukon', 'Rio Grande', 'Arkansas'],
        'length': [2341, 2202, 1979, 1759, 1450],
        'state': ['Montana', 'Minnesota', 'British Columbia', 'Colorado', 'Kansas']}

### Creating a dataframe again, but this time with an index which is used to refer to each row

In [3]:
river_frame = pd.DataFrame(river_dict, index=['river1', 'river2','river3','river4','river5',])

In [5]:
river_frame ##Notice each row having an index

        length        river             state
river1    2341     Missouri           Montana
river2    2202  Mississippi         Minnesota
river3    1979        Yukon  British Columbia
river4    1759   Rio Grande          Colorado
river5    1450     Arkansas            Kansas

In [8]:
#Override alphabetical columns and Set Column sequence
river_frame =pd.DataFrame(river_dict, columns=['river', 'length', 'state'], index=['river1', 'river2','river3','river4','river5',])

In [9]:
river_frame

              river  length             state
river1     Missouri    2341           Montana
river2  Mississippi    2202         Minnesota
river3        Yukon    1979  British Columbia
river4   Rio Grande    1759          Colorado
river5     Arkansas    1450            Kansas

### Refering to a row by using index

In [11]:
river_frame.loc['river1']

river     Missouri
length        2341
state      Montana
Name: river1, dtype: object

In [12]:
#Get all indices
river_frame.index

Index(['river1', 'river2', 'river3', 'river4', 'river5'], dtype='object')

In [13]:
#Add a new row
river_frame.loc['river6']=['Brazos', 860,'Texas']

In [14]:
river_frame

              river  length             state
river1     Missouri    2341           Montana
river2  Mississippi    2202         Minnesota
river3        Yukon    1979  British Columbia
river4   Rio Grande    1759          Colorado
river5     Arkansas    1450            Kansas
river6       Brazos     860             Texas

In [15]:
river_frame.loc['river5']=['New River', 934,'Florida']

In [16]:
river_frame

              river  length             state
river1     Missouri    2341           Montana
river2  Mississippi    2202         Minnesota
river3        Yukon    1979  British Columbia
river4   Rio Grande    1759          Colorado
river5    New River     934           Florida
river6       Brazos     860             Texas

### Surprisingly, index can be repeated and do not have to be unique

In [17]:
duplicate_index = pd.Series(range(5), index=['index1', 'index1', 'index2', 'index2', 'indexn'])

In [19]:
duplicate_index ##Notice more than 1 row having the same index

index1    0
index1    1
index2    2
index2    3
indexn    4
dtype: int64

In [20]:
#Access a duplicate index
duplicate_index.loc['index1']

index1    0
index1    1
dtype: int64

In [21]:
#update a duplicate index
duplicate_index.loc['index1']=10

In [22]:
duplicate_index

index1    10
index1    10
index2     2
index2     3
indexn     4
dtype: int64

In [27]:
river_frame.index=['index1', 'index2', 'index3', 'index4', 'index5', 'index6']

In [28]:
river_frame

              river  length             state
index1     Missouri    2341           Montana
index2  Mississippi    2202         Minnesota
index3        Yukon    1979  British Columbia
index4   Rio Grande    1759          Colorado
index5    New River     934           Florida
index6       Brazos     860             Texas